In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dinu8\appdata\local\programs\python\python310\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\dinu8\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dinu8\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dinu8\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dinu8\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\dinu8\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
my_list = [10, 20, 30]
series = pd.Series(my_list)

In [4]:
series.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
series

0    10
1    20
2    30
dtype: int64

In [6]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany', 'USSR', 'Japan'])
ser2 = pd.Series([1,2,3,4], index = ['USA', 'Germany', 'Italy', 'Japan'])

In [7]:
print(ser1)

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [8]:
print(ser2)

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [9]:
print(ser1 + ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [15]:
df = pd.DataFrame([[1,2,3,4], [2,3,4,6], [6,7,8,9]], index = ['a', 'b', 'c'], columns = ['x', 'y', 'z', 'd'])

In [16]:
df.head()

   x  y  z  d
a  1  2  3  4
b  2  3  4  6
c  6  7  8  9

In [18]:
print("shape", df.shape)
print("index", df.index)

shape (3, 4)
index Index(['a', 'b', 'c'], dtype='object')

In [53]:
weather_df = pd.read_csv("weather_2012.csv")

In [54]:
weather_df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog

In [55]:
print("shape", weather_df.shape)
print("index", weather_df.index)

shape (8784, 8)
index RangeIndex(start=0, stop=8784, step=1)

In [56]:
weather_df["Date/Time"].head()

0    2012-01-01 00:00:00
1    2012-01-01 01:00:00
2    2012-01-01 02:00:00
3    2012-01-01 03:00:00
4    2012-01-01 04:00:00
Name: Date/Time, dtype: object

In [57]:
type(weather_df["Date/Time"])

pandas.core.series.Series

In [58]:
# Now Converting the string to datetime datatype for the Date/Time Column
weather_df["Date/Time"] =  pd.to_datetime(weather_df["Date/Time"])

In [59]:
weather_df["Date/Time"].head()

0   2012-01-01 00:00:00
1   2012-01-01 01:00:00
2   2012-01-01 02:00:00
3   2012-01-01 03:00:00
4   2012-01-01 04:00:00
Name: Date/Time, dtype: datetime64[ns]

In [60]:
# Gives inofrmation about the DataFrame
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8784 entries, 0 to 8783
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date/Time           8784 non-null   datetime64[ns]
 1   Temp (C)            8784 non-null   float64
 2   Dew Point Temp (C)  8784 non-null   float64
 3   Rel Hum (%)         8784 non-null   int64
 4   Wind Spd (km/h)     8784 non-null   int64
 5   Visibility (km)     8784 non-null   float64
 6   Stn Press (kPa)     8784 non-null   float64
 7   Weather             8784 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(2), object(1)
memory usage: 549.1+ KB

In [61]:
# Gives all the unique values in the column
weather_df['Weather'].unique()

array(['Fog', 'Freezing Drizzle,Fog', 'Mostly Cloudy', 'Cloudy', 'Rain',
       'Rain Showers', 'Mainly Clear', 'Snow Showers', 'Snow', 'Clear',
       'Freezing Rain,Fog', 'Freezing Rain', 'Freezing Drizzle',
       'Rain,Snow', 'Moderate Snow', 'Freezing Drizzle,Snow',
       'Freezing Rain,Snow Grains', 'Snow,Blowing Snow', 'Freezing Fog',
       'Haze', 'Rain,Fog', 'Drizzle,Fog', 'Drizzle',
       'Freezing Drizzle,Haze', 'Freezing Rain,Haze', 'Snow,Haze',
       'Snow,Fog', 'Snow,Ice Pellets', 'Rain,Haze', 'Thunderstorms,Rain',
       'Thunderstorms,Rain Showers', 'Thunderstorms,Heavy Rain Showers',
       'Thunderstorms,Rain Showers,Fog', 'Thunderstorms',
       'Thunderstorms,Rain,Fog',
       'Thunderstorms,Moderate Rain Showers,Fog', 'Rain Showers,Fog',
       'Rain Showers,Snow Showers', 'Snow Pellets', 'Rain,Snow,Fog',
       'Moderate Rain,Fog', 'Freezing Rain,Ice Pellets,Fog',
       'Drizzle,Ice Pellets,Fog', 'Drizzle,Snow', 'Rain,Ice Pellets',
       'Drizzle,Snow,Fog', 'Rain,Snow Grains', 'Rain,Snow,Ice Pellets',
       'Snow Showers,Fog', 'Moderate Snow,Blowing Snow'], dtype=object)

In [62]:
weather_df['Wind Spd (km/h)'].unique()

array([ 4,  7,  6,  9, 15, 13, 20, 22, 19, 24, 30, 35, 39, 32, 33, 26, 44,
       43, 48, 37, 28, 17, 11,  0, 83, 70, 57, 46, 41, 52, 50, 63, 54,  2])

In [63]:
# Excludes null values and gives as the number as the output(i.e, total number of unique values)
weather_df['Weather'].nunique()

50

In [64]:
# The value_counts() function is mainly used for the number of times a values repeated in a single column
weather_df['Weather'].value_counts()

Weather
Mainly Clear                               2106
Mostly Cloudy                              2069
Cloudy                                     1728
Clear                                      1326
Snow                                        390
Rain                                        306
Rain Showers                                188
Fog                                         150
Rain,Fog                                    116
Drizzle,Fog                                  80
Snow Showers                                 60
Drizzle                                      41
Snow,Fog                                     37
Snow,Blowing Snow                            19
Rain,Snow                                    18
Thunderstorms,Rain Showers                   16
Haze                                         16
Drizzle,Snow,Fog                             15
Freezing Rain                                14
Freezing Drizzle,Snow                        11
Freezing Drizzle                              7
Freezing Drizzle,Fog                          6
Snow,Ice Pellets                              6
Snow,Haze                                     5
Freezing Rain,Fog                             4
Moderate Snow                                 4
Rain,Snow,Ice Pellets                         4
Freezing Fog                                  4
Snow Showers,Fog                              4
Thunderstorms,Rain Showers,Fog                3
Thunderstorms,Rain                            3
Freezing Drizzle,Haze                         3
Rain,Haze                                     3
Drizzle,Snow                                  2
Moderate Snow,Blowing Snow                    2
Thunderstorms                                 2
Freezing Rain,Haze                            2
Rain Showers,Snow Showers                     2
Freezing Rain,Snow Grains                     1
Thunderstorms,Heavy Rain Showers              1
Thunderstorms,Moderate Rain Showers,Fog       1
Thunderstorms,Rain,Fog                        1
Freezing Rain,Ice Pellets,Fog                 1
Moderate Rain,Fog                             1
Rain,Snow,Fog                                 1
Snow Pellets                                  1
Rain Showers,Fog                              1
Drizzle,Ice Pellets,Fog                       1
Rain,Ice Pellets                              1
Rain,Snow Grains                              1
Name: count, dtype: int64

# Data Manipulation

In [65]:
# How to get the Weather and Temperature columns from the weather_df dataframe

In [66]:
two_cols = weather_df[['Weather', 'Temp (C)']]
print(type(two_cols))
two_cols.head()

<class 'pandas.core.frame.DataFrame'>

                Weather  Temp (C)
0                   Fog      -1.8
1                   Fog      -1.8
2  Freezing Drizzle,Fog      -1.8
3  Freezing Drizzle,Fog      -1.5
4                   Fog      -1.5

In [67]:
# This is not prefered way to use for slicing so we use loc() and iloc() functions
weather_df[['Date/Time', 'Weather']][0:10:3]

            Date/Time               Weather
0 2012-01-01 00:00:00                   Fog
3 2012-01-01 03:00:00  Freezing Drizzle,Fog
6 2012-01-01 06:00:00                   Fog
9 2012-01-01 09:00:00                   Fog

In [68]:
# The loc function works based on the label location  for example in below we used indexing 0:5 then it will gwt the elements upto 5th row
weather_df.loc[0:5, ['Date/Time', 'Weather']]

            Date/Time               Weather
0 2012-01-01 00:00:00                   Fog
1 2012-01-01 01:00:00                   Fog
2 2012-01-01 02:00:00  Freezing Drizzle,Fog
3 2012-01-01 03:00:00  Freezing Drizzle,Fog
4 2012-01-01 04:00:00                   Fog
5 2012-01-01 05:00:00                   Fog

In [69]:
# The iloc function works based on the index available in the dataframe for example we used indexing 0:5 then it will get upto the 4th row and considers 0th row 
weather_df[['Date/Time', 'Weather']].iloc[0:5]

            Date/Time               Weather
0 2012-01-01 00:00:00                   Fog
1 2012-01-01 01:00:00                   Fog
2 2012-01-01 02:00:00  Freezing Drizzle,Fog
3 2012-01-01 03:00:00  Freezing Drizzle,Fog
4 2012-01-01 04:00:00                   Fog

In [70]:
# Find all instancess when snow was recorded
snowed_filter = weather_df['Weather'].str.lower().str.contains('snow')

In [73]:
weather_df[snowed_filter]

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
41,2012-01-02 17:00:00,-2.1,-9.5,57,22,25.0,99.66,Snow Showers
44,2012-01-02 20:00:00,-5.6,-13.4,54,24,25.0,100.07,Snow Showers
45,2012-01-02 21:00:00,-5.8,-12.8,58,26,25.0,100.15,Snow Showers
47,2012-01-02 23:00:00,-7.4,-14.1,59,17,19.3,100.27,Snow Showers
48,2012-01-03 00:00:00,-9.0,-16.0,57,28,25.0,100.35,Snow Showers
...,...,...,...,...,...,...,...,...
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9.7,100.13,Snow
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9.7,100.03,Snow
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4.8,99.95,Snow
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9.7,99.91,Snow
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11.3,99.89,Snow

In [75]:
# Find all instances when wind speed was above 24 and visibility was 25

In [77]:
df = weather_df[(weather_df['Wind Spd (km/h)'] > 24) & (weather_df['Visibility (km)'] == 25)]

In [79]:
df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
23,2012-01-01 23:00:00,5.3,2.0,79,30,25.0,99.31,Cloudy
24,2012-01-02 00:00:00,5.2,1.5,77,35,25.0,99.26,Rain Showers
25,2012-01-02 01:00:00,4.6,0.0,72,39,25.0,99.26,Cloudy
26,2012-01-02 02:00:00,3.9,-0.9,71,32,25.0,99.26,Mostly Cloudy
27,2012-01-02 03:00:00,3.7,-1.5,69,33,25.0,99.30,Mostly Cloudy

In [82]:
# Working with the columns
add_10 = weather_df['Wind Spd (km/h)']+ 10
add_10.head()

0    14
1    14
2    17
3    16
4    17
Name: Wind Spd (km/h), dtype: int64

In [83]:
# apply/ call functions
def time2(value):
    return value*2

t2 = weather_df['Wind Spd (km/h)'].apply(time2)
t2.head()

0     8
1     8
2    14
3    12
4    14
Name: Wind Spd (km/h), dtype: int64

In [84]:
# Renaming the columns
weather_df.rename(columns = {'Visibility (km)': 'Visibility (kilometeres)'}, inplace = True)

In [85]:
weather_df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (kilometeres),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog

In [86]:
# Dropping the column
# Here axis = 1 means the y-axis and axis = 0 means x-axis
weather_df = weather_df.drop(labels = ['Weather'], axis = 1).head(3)

In [87]:
weather_df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (kilometeres),Stn Press (kPa)
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26

In [88]:
data = {
    'A' : ['foo', 'foo', 'foo', 'bar', 'bar'],
    'B' : ['one', 'one', 'two', 'two', 'one'],
    'C' : ['x', 'y', 'z', 'x', 'z'],
    'D' : [1,2,3,4,5]
    
}

df = pd.DataFrame(data)

In [89]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  z  3
3  bar  two  x  4
4  bar  one  z  5

In [93]:
import numpy as np
pivot_df = df.pivot_table(values = 'D',
                         index = 'A',
                         columns = ['C'],
                         aggfunc = np.sum)

C:\Users\dinu8\AppData\Local\Temp\ipykernel_22692\1307626438.py:2: FutureWarning: The provided callable <function sum at 0x000001E8A1312320> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pivot_df = df.pivot_table(values = 'D',

In [94]:
pivot_df

C      x    y    z
A
bar  4.0  NaN  5.0
foo  1.0  2.0  3.0

In [95]:
# Join
left_df = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=['K0', 'K1', 'K2']) 

right_df = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
}, index=['K0', 'K2', 'K3'])

In [96]:
left_df

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [97]:
right_df

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [99]:
left_df.join(right_df, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [100]:
left_df.join(right_df, how = 'inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [102]:
# concat
pd.concat([left_df, right_df])

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

In [103]:
# Merging on multiple keys
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
    
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [104]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [105]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [106]:
pd.merge(left, right, how = 'left', on = ['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN